Repository: SAITECH-GLOBAL/SAIHUB-IOS
Catalog: Saihub/*.lproj/Localizable.strings
Languages: ru, zh_hans, zh_hant

# transfer_failed
source: Failed
ru: потерпеть неудачу
zh_hans: 转账失败
zh_hant: 轉帳失敗

source: Scan QR code
ru: Сканировать QR-код
zh_hans: 扫描二维码
zh_hant: 掃描二維碼

# open_touchid_hint
source: Please turn on FaceID/TouchID in Settings
ru: Активируйте сначала FaceID/TouchID в настройках
zh_hans: 请先在设置中开启TouchID
zh_hant: 請先在設置中開啓FaceID/TouchID

# open_faceid_hint
source: Please enable FaceID in settings first
ru: Сначала включите FaceID в настройках
zh_hans: 请先在设置中开启FaceID
zh_hant: 請先在設定中開啟FaceID

source: Address Type
ru: тип адреса
zh_hans: 地址类型
zh_hant: 地址類型

source: Biometric not recognized
ru: Биометрический не распознан
zh_hans: 生物验证无法识别
zh_hant: 生物驗證無法識別

# input_error_pwd_locked
source: Multiple input errors, password locked
ru: Несколько ошибок ввода, пароль заблокирован
zh_hans: 多次输入错误,密码锁定
zh_hant: 多次輸入錯誤，密碼鎖定

source: Insufficient balance
ru: Недостаточный баланс
zh_hans: 余额不足
zh_hant: 餘額不足

# iqkeyboard_done
source: Done
ru: Сделанный
zh_hans: 完成
zh_hant: 完成

# forget_pwdPopView_title
source: Reset Password
ru: сбросить пароль
zh_hans: 重置密码
zh_hant: 重置密碼

# forget_pwdPopView_subTitle
source: If you forget your current wallet password, enter the mnemonic/private key to reset it
ru: Если вы забыли свой текущий пароль кошелька, введите мнемонический/закрытый ключ, чтобы сбросить его.
zh_hans: 如果你忘记了当前钱包密码，请输入助记词/私钥将其重置
zh_hant: 如果你忘記了當前錢包密碼，請輸入助記詞/私密金鑰將其重置

source: Repeat Password
ru: Повторите пароль
zh_hans: 重复密码
zh_hant: 重複密碼

# Please_add_wallet
source: Please add a wallet
ru: Пожалуйста, добавьте кошелек
zh_hans: 请添加钱包
zh_hant: 請添加錢包

# Create_wallet_lock
source: Create a wallet, then turn on app lock
ru: Создайте кошелек, затем включите блокировку приложения
zh_hans: 创建钱包，然后开启应用锁
zh_hant: 創建錢包，然後開啟應用鎖

source: Skip
ru: пропуск
zh_hans: 跳过
zh_hant: 跳過

source: Load failure
zh_hans: 加载失败
zh_hant: 加載失敗

source: Reset successfully
ru: Сбросить успешно
zh_hans: 重置成功
zh_hant: 重置成功

# Auth_Face_ID
source: Auth with Face ID
ru: Авторизация с Face ID
zh_hans: 面容识别
zh_hant: 面容識別

# Auth_Touch_ID
source: Auth with Touch ID
ru: Авторизация с помощью Touch ID
zh_hans: 指纹识别
zh_hant: 指紋識別

# Lack_balance
source: Lack of balance
zh_hans: 余额不足
zh_hant: 餘額不足

source: Use Password
ru: Использовать пароль
zh_hans: 使用密码
zh_hant: 使用密碼

source: Face Pay
ru: Плата за лицо
zh_hans: 人脸支付
zh_hant: 人臉支付

source: Fingerprint Pay
ru: Отпечаток пальца
zh_hans: 指纹支付
zh_hant: 指紋支付

# co_signer_isnt_signed
source: co-signer%ld isn't signed
ru: Подписавшая сторона %ld не подписана
zh_hans: 签名参与方%ld 未签名
zh_hant: 簽名參與方%ld 未簽名

source: Add now
ru: добавить
zh_hans: 现在添加
zh_hant: 現在添加

source: + Add Wallet
ru: + Добавить кошелек
zh_hans: + 添加钱包
zh_hant: + 添加錢包

source: Add
ru: Добавить к
zh_hans: 添加
zh_hant: 添加

source: Copy successfully
ru: Копировать успешно
zh_hans: 复制成功
zh_hant: 複製成功

source: Total Power
ru: Общая мощность
zh_hans: 总用电量
zh_hant: 總用電量

source: Power Consumption
ru: Потребляемая мощность
zh_hans: 累计热量
zh_hant: 累計熱量

source: Water Temp
ru: Темп воды
zh_hans: 水温
zh_hant: 水溫

source: Water Pressure
ru: Давление воды
zh_hans: 水压
zh_hant: 水壓

source: Inlet
ru: Вход
zh_hans: 进水
zh_hant: 進水

source: Outlet
ru: Розетка
zh_hans: 出水
zh_hant: 出水

source: Indoor Temp
ru: Комнатная температура
zh_hans: 室内温度
zh_hant: 室內溫度

source: Outdoor Temp
ru: Температура наружного воздуха
zh_hans: 室外温度
zh_hant: 室外溫度

source: Cabinet Temp
ru: Температура в шкафу
zh_hans: 机柜温度
zh_hant: 機櫃溫度

source: Wrong Password
ru: неправильный пароль
zh_hans: 密码错误
zh_hant: 密碼錯誤

source: Copy success
ru: Копировать успешно
zh_hans: 复制成功
zh_hant: 複製成功

source: Share success
ru: поделиться успехом
zh_hans: 分享成功
zh_hant: 分享成功

source: + Add Wallet
zh_hans: + 添加钱包
zh_hant: + 添加錢包

source: Add now
zh_hans: 添加
zh_hant: 添加

# Omni_not_transfer
source: Omni does not support native Segregated Witness address transfers
ru: Omni не поддерживает передачу собственных адресов Segregated Witness.
zh_hans: Omni不支持原生隔离见证地址转账
zh_hant: Omni不支持原生隔離見證地址轉賬

source: Fee
ru: платеж
zh_hans: 手续费
zh_hant: 手續費

source: Please verify fingerprint
ru: Пожалуйста, подтвердите отпечаток пальца
zh_hans: 请验证指纹
zh_hant: 請驗證指紋

source: Please verify password
ru: Пожалуйста, подтвердите пароль
zh_hans: 请验证密码
zh_hant: 請驗證密碼

# Device_offline_tips
source: Device is offline, data loading failure
ru: Устройство не в сети, ошибка загрузки данных
zh_hans: 设备离线，数据加载失败
zh_hant: 設備離線，數據加載失敗

# Not_same_deal
source: It's not the same deal
ru: Это не та же сделка
zh_hans: 不是同一笔交易
zh_hant: 不是同一筆交易

source: Yes
ru: Да
zh_hans: 是
zh_hant: 是

source: etc.
ru: и т.п.
zh_hans: 等.
zh_hant: 等.

# networkErrorTitle
source: Refresh
ru: Обновить
zh_hans: 刷新
zh_hant: 重繪

# Backup_delete_confirm_title
source: Please backup the recovery phrase to prevent loss of assets.
ru: Создавайте резервные копии своих стипендий, чтобы предотвратить потерю активов.
zh_hans: 请确认备份助记词，防止资产丢失。
zh_hant: 請確認備份助記詞，防止資產丟失。

# wallet_ln
source: Lightning Wallet
ru: Молниеносный кошелек
zh_hans: 闪电钱包

# Refill_Local_Wallet
source: Refill with Local Wallet
ru: Пополнение местного кошелька
zh_hans: 本地钱包

# Refill_External_Wallet
source: Refill with External Wallet
ru: Пополнение с внешним кошельком
zh_hans: 外部钱包

source: BTC Wallet
ru: BTC-кошелек
zh_hans: 链上钱包

source: Lightning Network
zh_hans: 闪电网络

source: Expires in
ru: Действителен до
zh_hans: 有效期

source: Expired
ru: Просроченный
zh_hans: 已过期

# Expires_in_With
source: Expires in：
ru: Действителен до：
zh_hans: 有效期：

source: Potential Fee：
ru: Потенциальная плата：
zh_hans: 潜在费用：

source: Refill
ru: Пополнить
zh_hans: 钱包充值

source: Host
ru: Узлы
zh_hans: 节点

source: Add Lightning
ru: Добавить кошелек Lightning
zh_hans: 添加闪电钱包

source: Memo
ru: Памятка
zh_hans: 备注

source: Create Invoice
ru: Создать invoice
zh_hans: 创建支票

source: please pay：
ru: Пожалуйста, заплатите：
zh_hans: 请支付：

source: stas for：
ru: sats for：
zh_hans: 支付给：

# Please_backup_first
source: Backup first, please
ru: Сначала резервное копирование, пожалуйста
zh_hans: 请先备份

source: Lightning invoice
zh_hans: 闪电支票

source: On-chain
zh_hans: 链上充值

source: No Wallet
ru: Нет местного кошелька
zh_hans: 无本地钱包

source: Lightning Settings
ru: Настройки молнии
zh_hans: 闪电钱包设置

source: Import Lightning
ru: Импорт Lightning
zh_hans: 导入闪电钱包

source: Export
ru: Экспорт
zh_hans: 导出

source: Invoice/Lightning Address
zh_hans: Invocie/闪电地址

source: Pay
ru: Платежи
zh_hans: 支付

source: Import failed
ru: Сбой импорта
zh_hans: 导入失败

source: Import successfully
ru: Успешно импортируется
zh_hans: 导入成功

source: Payment successful
ru: Успешная оплата
zh_hans: 支付成功

# Saved
source: Saved successfully
ru: Сохранено
zh_hans: 保存成功

source: sats
zh_hans: 聪

source: Enter memo
ru: Введите примечание
zh_hans: 请输入备注

source: Scan LNDHub
ru: Сканирование LNDHub
zh_hans: 扫描LNDHub

source: Enter LNDHub
ru: Войти в LNDhub
zh_hans: 请输入LNDHub

source: Enter host
ru: Пожалуйста, введите узел
zh_hans: 请输入Host

source: Enter wallet name
ru: Пожалуйста, введите имя
zh_hans: 请输入名称

source: Host error
ru: Ошибка хоста
zh_hans: host节点错误

source: Wallet Type
ru: Тип кошелька
zh_hans: 选择类型

source: Lightning Address
ru: Адрес молнии
zh_hans: 闪电钱包地址

source: input paste hostUrl
ru: Введите или вставьте адрес
zh_hans: 输入或粘贴节点连接

source: Select type
ru: выбрать тип
zh_hans: 选择类型

# passphrase_desc
source: Passphrase
ru: Кодовая фраза

source: Number
ru: Номер

source: Ignore
ru: Игнорировать

source: Passphrase
ru: Кодовая фраза

source: Write Down Recovery Phrase
ru: Запасная мнемоническая фраза
zh_hant: 備份助記詞

# backup_phrase_hint1
source: Write down your recovery phrase,don’t take screenshorts or photo, obtaining recovery phrase equals owning all ssets.
ru: Пожалуйста, перепишите и сохраните Вашу мнемоническую фразу, пожалуйста, не делайте скриншотов или фотографий. Тот, кто завладеет Вашей мнемонической фразой, тот завладеет и средствами Вашего кошелька.
zh_hant: 請抄寫保存好你的助記詞，請勿截圖或拍照，誰掌握了助記詞就掌握了錢包資產

source: OK
ru: ОK

source: SAIHUB App
ru: Приложение SAIHUB
