Repository: SAITECH-GLOBAL/SAIHUB-IOS
Catalog: Saihub/*.lproj/Localizable.strings
Languages: ru, zh_hans, zh_hant

# wallet_assetTitle
source: Assets
ru: Средства
zh_hans: 资产
zh_hant: 資產

source: Add Wallet
ru: Добавить
zh_hans: 添加钱包
zh_hant: 添加錢包

# content_copy_success
source: Content copied to clipboard
ru: Успешно скопировано
zh_hans: 复制成功
zh_hant: 複製成功

# export_tip_private
source: The private key is not encrypted, please export it carefully and make a safe backup!When backing up the private key, please make sure that no one is around!
ru: Секретный ключ не зашифрован, экспортируйте с осторожностью, подготовьте безопасную резервный ключ! При создании резервного секретного ключа убедитесь, что поблизости нет посторонних лиц или видеоконтроля.
zh_hans: 私钥没有加密，请小心导出，做好安全备份！备份私钥时，请确保周围没有他人或监控
zh_hant: 私鑰沒有加密，請小心導出，做好安全備份！備份私鑰時，請確保周圍沒有他人或監控。

# reset_tip
source: If you forget unlock password, please enter anyone wallet password to reset unlock password
ru: Если Вы забыли пароль разблокировки приложения, чтобы сбросить пароль разблокировки, введите, пожалуйста, любой пароль от кошелька
zh_hans: 如果忘记APP解锁密码，请输入任意钱包密码重置解锁密码
zh_hant: 如果忘記APP解鎖密碼，請輸入任意錢包密碼重置解鎖密碼

# please_enter_right_phrase_or_privatekey
source: Please enter the correct private key or recovery phrase
ru: Введите правильную мнемоническую фразу или секретный ключ
zh_hans: 请输入正确的助记词或私钥
zh_hant: 請輸入正確的助記詞或私鑰

# verify_pwd_address_export_key_hint2
source: Once the private key or recovery phrase are leaked, the assets can be controlled by others
ru: Как только мнемоническая фраза/секретный ключ будут утеряны или станут известны посторонним лицам, средства могут быть украдены или не смогут быть восстановлены
zh_hans: 一旦助记词/私钥丢失或泄露，资产可能被窃或无法找回
zh_hant: 一旦助記詞/私鑰丟失或洩露，資產可能被竊或無法找回

# export_private_key_tip
source: Tap to show QR code of the private key
ru: Кликните, чтобы раскрыть QR-код секретного ключа
zh_hans: 点击以展示私钥二维码
zh_hant: 點擊以展示私鑰二維碼

# add_wallet_tip
source: Create or import wallets to manage your crypto assets
ru: Для начала управления Вашими средствами сначала создайте или введите кошелек
zh_hans: 请先创建或导入钱包，开始管理你的资产
zh_hant: 請先創建或導入錢包，開始管理你的資產

# multi_sign_tip
source: This is a Partially Signed Bitcoin Transaction (PSBT). Please finish signing it with your hardware wallet
ru: Это частично подписанная биткоин-транзакция (PSBT), пожалуйста, завершите подпись в холодном кошельке
zh_hans: 这是一个部分签名的比特币交易 (PSBT),请在冷钱包完成签名
zh_hant: 這是一個部分簽名的比特幣交易 (PSBT),請在冷錢包完成簽名

source: Agree
ru: Согласен
zh_hans: 同意
zh_hant: 同意

# agreement_tip
source: I have carefully read and agree to the
ru: Я внимательно прочитал и согласен
zh_hans: 我已经仔细阅读并且同意
zh_hant: 我已經仔細閱讀並且同意

# agreement
source: User Agreement
ru: Пользовательское соглашение
zh_hans: 用户协议
zh_hant: 用戶協議

# set_tp_tip
source: SAIHUB Setup
ru: Зарегистрироваться в SAIHUB
zh_hans: SAIHUB 注册
zh_hant: SAIHUB 註冊

# login_password
source: Password Login
ru: Вход по паролю
zh_hans: 密码登录
zh_hant: 密碼登錄

# login_touch
source: Auth with Touch ID
ru: Идентификация по отпечатку пальца
zh_hans: 指纹识别
zh_hant: 指紋識別

# reset_title
source: Reset Unlock Password
ru: Сбросить пароль разблокировки
zh_hans: 重置解锁密码
zh_hant: 重置解鎖密碼

source: Confirm
ru: Подтвердить
zh_hans: 确认
zh_hant: 確認

source: Reset
ru: Сбросить
zh_hans: 重置
zh_hant: 重置

source: Reset Password
ru: Сбросить пароль
zh_hans: 重置密码
zh_hant: 重置密碼

# reset_password_0
source: Set Unlock Password
ru: Сбросить пароль разблокировки
zh_hans: 重置解锁密码
zh_hant: 重置解鎖密碼

# reset_password_1
source: Repeat Unlock Password
ru: Введите пароль разблокировки еще раз
zh_hans: 再次输入解锁密码
zh_hant: 再次輸入解鎖密碼

# reset_hint
source: Enter Anyone Wallet Password
ru: Введите любой пароль от кошелька
zh_hans: 输入任意钱包密码
zh_hant: 輸入任意錢包密碼

# wallet_pwd_error
source: Password error, please try again
ru: Ошибка пароля, попробуйте еще раз
zh_hans: 密码错误，请重试
zh_hant: 密碼錯誤，請重試

source: Cancel
ru: Отменить
zh_hans: 取消
zh_hant: 取消

source: Wallet Name
ru: Имя кошелька
zh_hans: 钱包名
zh_hant: 錢包名

source: Set Password
ru: Установить пароль
zh_hans: 设置密码
zh_hant: 設置密碼

# pwd_tip_0
source: Password can't be less than 8 chars
ru: Пароль не может быть менее 8 символов
zh_hans: 密码不能少于8位
zh_hant: 密碼不能少於8位

# pwd_tip_1
source: Please repeat the password
ru: Введите пароль еще раз
zh_hans: 请再次输入密码
zh_hant: 請再次輸入密碼

# privacy_tip
source: I agree to the
ru: Я согласен
zh_hans: 我同意
zh_hant: 我同意

# privacy_service
source: Terms of Service
ru: Соглашение об обслуживании
zh_hans: 服务协议
zh_hant: 服務協議

source: Create
ru: Создайте
zh_hans: 创建
zh_hant: 創建

source: Import wallet
ru: Ввести кошелек
zh_hans: 导入钱包
zh_hant: 導入錢包

# phrase_tip_0
source: Write Down Recovery Phrase
ru: Запасная мнемоническая фраза
zh_hans: 备份助记词
zh_hant: 備份助記詞

# phrase_tip_1
source: Write down your recovery phrase,don’t take screenshorts or photo, obtaining recovery phrase equals owning all ssets.
ru: Пожалуйста, перепишите и сохраните Вашу мнемоническую фразу, пожалуйста, не делайте скриншотов или фотографий. Тот, кто завладеет Вашей мнемонической фразой, тот завладеет и средствами Вашего кошелька.
zh_hans: 请抄写保存好你的助记词，请勿截图或拍照，谁掌握了助记词就掌握了钱包资产
zh_hant: 請抄寫保存好你的助記詞，請勿截圖或拍照，誰掌握了助記詞就掌握了錢包資產

# phrase_select_tip
source: Recovery Phrase Length
ru: Выберите длину мнемонической фразы
zh_hans: 选择助记词长度
zh_hant: 選擇助記詞長度

# continue_desc
source: Continue
ru: Далее
zh_hans: 下一步
zh_hant: 下一步

# pwd_weak
source: Weak
ru: Слабый
zh_hans: 弱
zh_hant: 弱

# pwd_medium
source: Medium
ru: Средний
zh_hans: 中
zh_hant: 中

# pwd_strong
source: Strong
ru: Сильный
zh_hans: 强
zh_hant: 強

# recovery_title
source: Your Recovery Phrase
ru: Запасная мнемоническая фраза
zh_hans: 备份助记词
zh_hant: 備份助記詞

# recovery_content
source: Write down the following words in order.
ru: Пожалуйста, перепишите мнемоническую фразу по порядку
zh_hans: 请按照顺序抄写助记词
zh_hant: 請按照順序抄寫助記詞

# complete_tip
source: Completed, Verify it
ru: Проверить фразу
zh_hans: 完成备份，进行验证
zh_hant: 完成備份，進行驗證

# verify_title
source: Verify Recovery Phrase
ru: Проверка подлинности мнемонической фразы
zh_hans: 助记词验证
zh_hant: 助記詞驗證

# verify_result
source: Validation results
ru: Результат проверки подлинности
zh_hans: 验证结果
zh_hant: 驗證結果

source: Verify success
ru: Проверка подлинности успешно пройдена
zh_hans: 验证成功
zh_hant: 驗證成功

# set_passphrase_desc
source: Set Passphrase
ru: Установить кодовую фразу
zh_hans: 设置 Passphrase
zh_hant: 設置 Passphrase

# passphrase_tip
source: If you don't know what Passphrase is, it's best to skip
ru: В случае если Вы не знаете, что такое кодовая фраза, рекомендуется пропустить
zh_hans: 如果您不知道什么是 Passphrase，建议直接跳过
zh_hant: 如果您不知道什麼是 Passphrase，建議直接跳過

# set_passphrase_tip
source: Passphrase has no rules or length limits, please backup safely
ru: По отношению к кодовой фразе отсутствуют ограничения по длине и нормам, пожалуйста, обязательно сделайте ее безопасную резервную копию
zh_hans: Passphrase 没有长度和规则限制，请务必安全备份
zh_hant: Passphrase 沒有長度和規則限制，請務必安全備份

# set_passphrase_hint_0
source: Enter Password
ru: Введите кодовую фразу
zh_hans: 输入密码
zh_hant: 輸入密码

# set_passphrase_forpassphrase_hint_0
source: Enter Passphrase
zh_hans: 输入 Passphrase
zh_hant: 輸入 Passphrase

# set_passphrase_hint_1
source: Please repeat the Passphrase
ru: Введите кодовую фразу еще раз
zh_hans: 请再次输入 Passphrase
zh_hant: 請再次輸入 Passphrase

# import_wallet_tip_0
source: Please enter your recovery phrase,Private Key,Public Pey.
ru: Можно вводить мнемонические фразы, секретные ключи, открытые ключи
zh_hans: 可以导入助记词、私钥、公钥、
zh_hant: 可以導入助記詞、私鑰、公鑰、

# import_wallet_tip_1
source: Watch Wallet Address,
ru: адрес наблюдения
zh_hans: 观察地址
zh_hant: 觀察地址

source: Cold Wallet
ru: холодный кошелек
zh_hans: 冷钱包
zh_hant: 冷錢包

# import_wallet_hint
source: If enter recovery phrase separated by space
ru: При введении слов мнемонической фразы, пожалуйста, используйте пробелы для разделения
zh_hans: 输入助记词请用空格间隔
zh_hant: 輸入助記詞請用空格間隔

# import_desc
source: Import
ru: Ввод
zh_hans: 导入
zh_hant: 導入

# passphrase_hint
source: Please enter Passphrase
ru: Пожалуйста, введите кодовую фразу
zh_hans: 请输入 Passphrase
zh_hant: 請輸入 Passphrase

source: Assets
ru: Средства
zh_hans: 资产

source: Wallet List
ru: Кошельки
zh_hans: 钱包列表
zh_hant: 錢包列表

# add_desc
source: ＋ Add
ru: + добавить
zh_hans: ＋ 添加

# wallet_btc
source: BTC Wallet
ru: BTC кошелек
zh_hans: BTC 钱包
zh_hant: BTC 錢包

# wallet_ob
source: Watch Wallet
ru: Кошелек наблюдения
zh_hans: 观察钱包
zh_hant: 觀察錢包

# record_all
source: All
ru: Все
zh_hans: 所有
zh_hant: 所有

# record_out
source: Out
ru: Вывести
zh_hans: 转出
zh_hant: 轉出

# record_in
source: In
ru: Перечислить
zh_hans: 转入
zh_hant: 轉入

# record_failed
source: Failed
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# et_address_hint
source: Input or paste an address
ru: Ввести или вставить обмена адрес
zh_hans: 输入或粘贴地址
zh_hant: 輸入或粘貼地址

source: To
ru: Аккаунт для получения средств
zh_hans: 收款帐号
zh_hant: 收款帳號

source: Amount
ru: Перечисляемое количество
zh_hans: 转账数量
zh_hant: 轉賬數量

# et_amount_hint
source: Input transfer amount
ru: Ввести сумму к перечислению
zh_hans: 输入转账金额
zh_hant: 輸入轉賬金額

source: Miner Fee
ru: Цена на майнер
zh_hans: 矿工费
zh_hant: 礦工費

source: Refresh Address
ru: Обновить адрес
zh_hans: 刷新地址
zh_hant: 刷新地址

# scan_signed
source: Scan Signed Transaction
ru: Сканировать данные подписи
zh_hans: 扫描签名信息
zh_hant: 掃描簽名信息

source: Signature Status
ru: Статус подписи
zh_hans: 签名状态
zh_hant: 簽名狀態

source: Resignature
ru: Обновить подпись
zh_hans: 重新签名
zh_hant: 重新簽名

source: Send Now
ru: Отправить
zh_hans: 发送
zh_hant: 發送

# main_item_wallet
source: Wallet
ru: Кошелек
zh_hans: 钱包
zh_hant: 錢包

# main_item_pool
source: Mining Pool
ru: Майнинг-пул
zh_hans: 矿池
zh_hant: 礦池

# main_item_power
source: Energy
ru: Ресурсы
zh_hans: 能源
zh_hant: 能源

# main_item_settings
source: Settings
ru: Настройки
zh_hans: 设置
zh_hant: 設置

# string_tips_exit
source: click again to exit
ru: Кликнуть еще раз для выхода
zh_hans: 再次点击退出
zh_hant: 再次點擊退出

source: Add observer link
ru: Добавить подключение к наблюдателю
zh_hans: 添加观察者连接
zh_hant: 添加觀察者連接

source: Edict observer link
ru: Редактировать ссылку наблюдателя
zh_hans: 修改观察者连接
zh_hant: 修改觀察者連接

source: Remark Name
ru: Примечание
zh_hans: 备注
zh_hant: 備注

source: Enter the remark name
ru: Введите примечание о подключении
zh_hans: 请输入连接备注
zh_hant: 請輸入連接備注

# poll_save_error
source: Pool Save Error
ru: Сбой при сохранении
zh_hans: 保存失败
zh_hant: 保存失敗

source: Observer Links List
ru: Список подключений
zh_hans: 连接列表
zh_hant: 連接列表

source: Delete Success
ru: Успешно удалено
zh_hans: 删除成功
zh_hant: 刪除成功

source: Name
ru: Примечание
zh_hans: 备注
zh_hant: 備注

# power_add_number_hint
source: Input or paste an address
ru: Ввести или вставить адрес связи
zh_hans: 输入或粘贴连接地址
zh_hant: 輸入或粘貼連接地址

# poll_add_url_hint
source: Vaild observer link
ru: Активное подключение к наблюдателю
zh_hans: 有效的观察者连接
zh_hant: 有效的觀察者連接

source: Power Save Error
ru: Сбой при сохранении устройства
zh_hans: 设备保存失败
zh_hant: 設備保存失敗

source: Add a Power
ru: Добавить устройство
zh_hans: 添加设备
zh_hant: 添加設備

# poll_empty_hint
source: Add an observer link to follow the mining pool data.
ru: Добавить ссылку наблюдателя, раскрыть данные о майнинг-пуле
zh_hans: 添加观察者链接，展示矿池数据
zh_hant: 添加觀察者鏈接，展示礦池數據

# power_empty_hint
source: Add energy devices to follow the energy data.
ru: Привязать устройство, раскрыть данные о системе ресурсов
zh_hans: 绑定设备，展示能源数据
zh_hant: 綁定設備，展示能源數據

source: Power System
ru: Система ресурсов
zh_hans: 能源系统
zh_hant: 能源系統

source: Online
ru: Онлайн
zh_hans: 在线
zh_hant: 在線

source: Offline
ru: Офлайн
zh_hans: 离线
zh_hant: 離線

source: Language
ru: Язык
zh_hans: 语言
zh_hant: 語言

source: Currency Unit
ru: Единица законной валюты
zh_hans: 法币单位
zh_hant: 法幣單位

source: Edict Device
ru: Изменить устройство
zh_hans: 修改设备
zh_hant: 修改設備

# device_exists
source: Device already exists
zh_hans: 设备已存在
zh_hant: 設備已存在

source: Address Book
ru: Адресная книга
zh_hans: 地址簿
zh_hant: 地址簿

source: Unlock Setting
ru: Установка блокировки приложения
zh_hans: 应用锁设置
zh_hant: 應用鎖設置

source: App Version
ru: Версия приложения
zh_hans: App 版本
zh_hant: App 版本

source: Languages
ru: Язык
zh_hans: 语言
zh_hant: 語言

source: Save
ru: Сохранить
zh_hans: 保存
zh_hant: 保存

source: Add Address
ru: добавить адрес
zh_hans: 添加地址
zh_hant: 添加地址

# add_address_title
source: Add Address
ru: Добавить адрес
zh_hans: 添加地址
zh_hant: 添加地址

# edict_address_title
source: Edict Address
zh_hans: 编辑地址
zh_hant: 編輯地址

source: Foundation
ru: Основная цепь
zh_hans: 主链
zh_hant: 主鏈

source: Please Enter a name
ru: Введите имя
zh_hans: 请输入名字
zh_hant: 請輸入名字

source: Address
ru: Адрес
zh_hans: 地址
zh_hant: 地址

source: Scan or paste wallet address
ru: Сканировать код или вставить адрес
zh_hans: 扫码或粘贴地址
zh_hant: 掃碼或粘貼地址

source: Address Book Save Error
ru: Сбой при сохранении адреса
zh_hans: 地址保存失败
zh_hant: 地址保存失敗

source: Copy Address
ru: Скопировать адрес
zh_hans: 复制地址
zh_hant: 複製地址

source: Edit
ru: Редактировать
zh_hans: 编辑
zh_hant: 編輯

source: Copy URL
ru: Скопировать URL
zh_hans: 复制 URL
zh_hant: 複製 URL

source: Delete
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

source: Next
ru: Далее
zh_hans: 下一步
zh_hant: 下一步

# addres_format_error
source: Address format error
ru: Ошибка формата адреса
zh_hans: 地址格式错误
zh_hant: 地址格式錯誤

source: Unlocked Password
ru: Пароль разблокировки
zh_hans: 解锁密码
zh_hant: 解鎖密碼

source: Password
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

source: Set Password Login
ru: Настройка входа по паролю
zh_hans: 密码登录设置
zh_hant: 密碼登錄設置

source: Repeat
ru: Введите еще раз
zh_hans: 再次輸入
zh_hant: 再次輸入

source: Unlock Password
ru: Пароль разблокировки
zh_hans: 解锁密码
zh_hant: 解鎖密碼

# wal_two_pwd_not_match
source: The two passwords entered do not match, please try again
ru: Введенные дважды данные не совпадают, попробуйте еще раз
zh_hans: 两次输入不一致，请重试
zh_hant: 兩次輸入不一致，請重試

source: Set Touch ID
ru: Установить Touch ID
zh_hans: 设置 Touch ID
zh_hant: 設置 Touch ID

# pwd_reset_success
source: Password reset succesful
ru: Сброс пароля выполнен успешно
zh_hans: 密码重置成功
zh_hant: 密碼重置成功

source: Wrong Passwrod
ru: Пароль
zh_hans: 密码错误
zh_hant: 密碼錯誤

# pwd_not_match
source: Password doesn't match
ru: Два пароля не совпадают
zh_hans: 两次密码不一致
zh_hant: 兩次密碼不一致

# enter_Wallet_desc
source: Go To Wallet
ru: введите кошелек
zh_hans: 进入钱包
zh_hant: 進入錢包

# current_version_number
source: Current Version
ru: Текущая версия
zh_hans: 当前版本
zh_hant: 當前版

source: Update App
ru: Обновить приложение
zh_hans: 更新 App
zh_hant: 更新 App

# update_version_hint
source: Update the app to the latest version
ru: Обновить до последней версии
zh_hans: 更新至最新版本
zh_hant: 更新至最新版本

source: Update Now
ru: Обновить сейчас
zh_hans: 现在更新
zh_hant: 現在更新

source: Wallet settings
ru: Настройка кошелька
zh_hans: 钱包设置
zh_hant: 錢包設置

source: Backup Private Key
ru: Запасной секретный ключ
zh_hans: 备份私钥
zh_hant: 備份私鑰

source: Modify Password
ru: Изменить пароль
zh_hans: 修改密码
zh_hant: 修改密碼

source: Address Manager
ru: Управление адресом
zh_hans: 地址管理
zh_hant: 地址管理

source: Delete Wallet
ru: Удалить кошелек
zh_hans: 删除钱包
zh_hant: 刪除錢包

source: Verify Password
ru: Проверка подлинности пароля
zh_hans: 验证密码
zh_hant: 驗證密碼

source: Old Password
ru: Старый пароль
zh_hans: 旧密码
zh_hant: 舊密碼

source: New Password
ru: Новый пароль
zh_hans: 新密码
zh_hant: 新密碼

# enter_old_pwd
source: Enter Old Password
ru: Введите старый пароль
zh_hans: 输入旧密码
zh_hant: 輸入舊密碼

source: Enter Password
ru: Введите пароль
zh_hans: 输入密码
zh_hant: 輸入密碼

source: Enter New Password
ru: Введите новый пароль
zh_hans: 输入新密码
zh_hant: 輸入新密碼

source: Forget Password?
ru: Забыли пароль?
zh_hans: 忘记密码?
zh_hant: 忘記密碼?

# error_pwd_style
source: Please enter the 8-20 digit password
ru: Введите пароль из 8-20 символов
zh_hans: 请输入8-20位密码
zh_hant: 請輸入8-20位密碼

# original_password_wrong
source: Original password error
ru: Ошибка исходного пароля
zh_hans: 原密码错误
zh_hant: 原密碼錯誤

# the_two_passwords_do_not_match
source: Password doesn't match
ru: Пароль не совпадает
zh_hans: 密码不匹配
zh_hant: 密碼不匹配

source: Complete
ru: Выполнено
zh_hans: 完成
zh_hant: 完成

source: mnemonic/private key
ru: Мнемоническая фраза/Секретный ключ
zh_hans: 助记词/私钥
zh_hant: 助記詞/私鑰

# reset_pwd_input_hint
source: enter the mnemonic/private key
ru: Введите мнемоническую фразу или секретный ключ
zh_hans: 输入助记词或私钥
zh_hant: 輸入助記詞或私鑰

source: Password reset successful
ru: Пароль успешно установлен заново
zh_hans: 重置密码成功
zh_hant: 重置密碼成功

source: Add Passphrase
ru: Добавить кодовую фразу
zh_hans: 添加 Passphrase
zh_hant: 添加 Passphrase

source: Please Input a Passphrase
ru: Введите кодовую фразу
zh_hans: 输入 Passphrase
zh_hant: 輸入 Passphrase

# add_passphrase_hint2
source: Important Information: 1. When a Hidden Wallet is created, its Passphrase cannot be changed. If the Passphrase is lost or forgotten, the Hidden Wallet and all its assets will be irretrievable. Record and store the Passphrase securely before creating a Hidden Wallet 2. Keep the Passphrase field blank to enter the default Wallet
ru: Важное напоминание. При создании кошелька нельзя изменять его кодовую фразу. В случае если вы потеряли или забыли кодовую фразу, кошелек и все его средства восстановлению не подлежат. До создания кошелька с кодовой фразой запомните и сохраните в безопасности кодовую фразу. Кошелек, восстанавливаемый по умолчанию при сохранении области ввода пароля пустой
zh_hans: 重要提示 当一个钱包被创建时，它的 Passphrase 不能被改变。如果 Passphrase 丢失或遗忘，钱包和它的所有资产都将无法恢复。在创建Passphrase 钱包之前，请记录并安全地存储 Passphrase 。保持密码字段空白恢复默认的钱包
zh_hant: 重要提示 當一個錢包被創建時，它的 Passphrase 不能被改變。如果 Passphrase 丟失或遺忘，錢包和它的所有資產都將無法恢復。在創建Passphrase 錢包之前，請記錄並安全地存儲 Passphrase 。保持密碼字段空白恢復默認的錢包

# add_passphrase_hint3
source: Passphrases cannot exceed 128 characters. Can consist of upper and lower case letters, digits, and symbols, but not spaces. Case Sensitive.
ru: Длина кодовой фразы не может быть более 128 символов. Может состоять из заглавных и строчных букв, цифр и символов, не содержит пробелы, обладает чувствительностью к регистру символов.
zh_hans: Passphrse不能长于128个字符。可以由大、小写字母、数字和符号组成，不包含空格，大小写敏感。
zh_hant: Passphrse不能長於128個字符。可以由大、小寫字母、數字和符號組成，不包含空格，大小寫敏感。

# add_phassphrase_et_hint1
source: Enter a Passphrase (case sensitive)
ru: Введите кодовую фразу (чувствительна к регистру символов)
zh_hans: 输入 Passphrase（区分大小写）
zh_hant: 輸入 Passphrase（區分大小寫）

source: Enter Passphrase Again
ru: Введите кодовую фразу еще раз
zh_hans: 再次输入Passphrase
zh_hant: 再次 輸入Passphrase

# pasaphrase_does_not_match
source: Passphrase does not match
ru: Дважды введенные кодовые фразы не совпадают
zh_hans: Passphrase两次输入不一致
zh_hant: Passphrase兩次輸入不一致

source: Passphrase cannot exceed 128 characters
ru: Длина кодовой фразы не может быть более 128 символов
zh_hans: Passphrase 不能长于128位字符
zh_hant: Passphrase 不能長於128位字符

# pwd_tip
source: must be at least 8 characters long
ru: Не может быть менее 8 символов
zh_hans: 不能少于8位字符
zh_hant: 不能少於8位字符

# pwd_repeat_tip
source: Password does not match
ru: Пароль не совпадает
zh_hans: 密码不一致
zh_hant: 密碼不一致

# verify_phrase_tip
source: wrong recovery phrase, check and try again
ru: Ошибка мнемонической фразы, проверьте и попробуйте еще раз
zh_hans: 助记词错误，请检查后重试
zh_hant: 助記詞錯誤，請檢查後重試

source: Backup Recovery Phrase
ru: Запасная мнемоническая фраза
zh_hans: 备份助记词
zh_hant: 備份助記詞

source: Add Passphrase Wrong
ru: Сбой при добавлении кодовой фразы
zh_hans: 添加 Passphrase 失败
zh_hant: 添加 Passphrase 失敗

# verify_pwd_address_export_key_hint1
source: Verify Password To Export Private Key
ru: Проверка подлинности пароля, экспорт секретного ключа
zh_hans: 验证密码，导出私钥
zh_hant: 驗證密碼，導出私鑰

source: Copy Private Key
ru: Копировать секретный ключ
zh_hans: 复制私钥
zh_hant: 複製私鑰

# passphrase_repeat_tip
source: Password doesn't match
ru: Введенная кодовая фраза не совпадает
zh_hans: 密码输入不一致
zh_hant: 密码輸入不一致

# passphrase_forpassphrase_repeat_tip
source: Passphrase doesn't match
ru: Парольная фраза не совпадает
zh_hans: Passphrase 输入不一致
zh_hant: Passphrase 輸入不一致

source: fingerprint verification success
ru: Проверка подлинности отпечатков пальцев успешно выполнена
zh_hans: 指纹验证成功
zh_hant: 指紋驗證成功

source: fingerprint verification failed
ru: Сбой проверки подлинности отпечатков пальцев
zh_hans: 指纹验证失败
zh_hant: 指紋驗證失敗

# device_locked
source: The device is locked
zh_hans: 设备已锁

# password_error_try_again
source: Password error, please try again
ru: Ошибка пароля, попробуйте еще раз
zh_hans: 密码错误，请重试
zh_hant: 密碼錯誤，請重試

# input_paste_number
source: Input or paste the number
ru: Истекло время подключения к услуге
zh_hans: 输入或粘贴设备号
zh_hant: 輸入或粘貼設備號

source: No
ru: Нет
zh_hans: 否
zh_hant: 否

# add_wallet_now
source: Add now
ru: добавить
zh_hans: 添加
zh_hant: 添加

# dialog_delete_confirm_hint
source: It can not be recovered after delete,confirm?
ru: Не подлежит восстановлению после удаления, подтвердите
zh_hans: 删除后无法恢复，请确认
zh_hant: 刪除後無法恢復，請確認

# dialog_delete_confirm_title
source: Confirm to delete it?
ru: Подтвердить удаление?
zh_hans: 确认删除？
zh_hant: 確認刪除？

# wallet_import_error
source: No Wallet were found
ru: Кошелек не обнаружен
zh_hans: 没有发现钱包
zh_hant: 沒有發現錢包

# same_wallet_tip
source: The wallet already exists
ru: Кошелек уже существует
zh_hans: 钱包已存在
zh_hant: 錢包已存在

# more_desc
source: More
ru: Больше
zh_hans: 更多
zh_hant: 更多

# server_connecdtion_timeout
source: Server connection timeout
ru: Истекло время подключения к услуге
zh_hans: 服务连接超时
zh_hant: 服務連接超時

# edit_obsever_link
source: Edit observer link
ru: Редактировать ссылку наблюдателя
zh_hans: 编辑观察者链接
zh_hant: 編輯觀察者鏈接

# input_paste_address
source: Input or paste an address
ru: Ввести или вставить обмена адрес
zh_hans: 输入或粘贴地址
zh_hant: 輸入或粘貼地址

source: Edit Address
ru: Редактировать адрес
zh_hans: 编辑地址
zh_hant: 編輯地址

source: Please try again.
ru: Попробуйте еще раз
zh_hans: 请重试.
zh_hant: 請重試.

source: Invalid URL link
ru: Неактивная URL ссылка
zh_hans: 无效的URL链接
zh_hant: 無效的URL鏈接

# copy_address_success
source: Address copied to clipboard
ru: Адрес скопирован в буфер обмена
zh_hans: 已复制地址到剪接板
zh_hant: 已複製地址到剪接板

# file_read_write_permission_hint
source: 1need your authorization to read and write storage permissions
ru: 1 Требуется Ваше согласие для наделения полномочиями для считывания, записи и сохранения
zh_hans: 1需要您同意读写存储权限
zh_hant: 需要您同意讀寫存儲權限

# unable_to_find_file_path
source: File path not found
ru: Путь к файлу не найден
zh_hans: 没有找到文件路径
zh_hant: 沒有找到文件路徑

# request_permission_failed
source: Permission request failed
ru: Сбой при запросе полномочий
zh_hans: 权限请求失败
zh_hant: 權限請求失敗

# swap_rationale_ask_again
source: This app may not work correctly without the requested permissions. Open the app settings screen to modify app permissions.
ru: Приложению не хватает полномочий, функционирование невозможно
zh_hans: App 缺少权限，无法运行
zh_hant: App 缺少權限，無法運行

# swap_title_settings_dialog
source: Permissions Required
ru: Запросить полномочия
zh_hans: 申请权限
zh_hant: 申請權限

source: Sign Error
ru: Сбой при входе
zh_hans: 登录失败
zh_hant: 登錄失敗

# balance_not_sufficient
source: insufficient balance
ru: Сумма недостаточна
zh_hans: 余额不足
zh_hant: 餘額不足

source: Send Address
ru: Отправить адрес
zh_hans: 发送地址
zh_hant: 發送地址

# receive_address
source: Receiving Address
ru: Принять адрес
zh_hans: 接收地址
zh_hant: 接收地址

# enter_pwd
source: Enter Password
ru: Введите пароль 2
zh_hans: 输入密码2
zh_hant: 輸入密碼

source: Address already exists
ru: Адрес уже существует
zh_hans: 地址已存在
zh_hant: 地址已存在

source: Up to 20 addresses
ru: Максимум 20 адресов
zh_hans: 最多 20 个地址
zh_hant: 最多 20 個地址

# list_is_full
source: The list is full
ru: Список заполнен
zh_hans: 列表已满
zh_hant: 列表已滿

source: Device alreay exists
ru: Устройство привязывалось ранее
zh_hans: 设备绑定过了
zh_hant: 設備綁定過了

# import_loading
source: Import Wallet …
ru: Ввод кошелька…
zh_hans: 导入钱包 …
zh_hant: 導入錢包 …

# wallet_num_tip
source: Up to 10 wallets
ru: Максимум 10 кошельков
zh_hans: 最多10个钱包
zh_hant: 最多10個錢包

# transfer_success
source: Successful transfer
ru: Успешный перевод
zh_hans: 转账成功
zh_hant: 轉帳成功

# receive_success
source: Successfully received
ru: Успешно получено
zh_hans: 收款成功
zh_hant: 收款成功

# to_address
source: From
ru: адрес отправки
zh_hans: 发送地址
zh_hant: 發送地址

# from_address
source: To
ru: адрес получения
zh_hans: 接收地址
zh_hant: 接收地址
